'''
[৫২ সমস্যা বই] যোগফল নির্ণয়
প্রবলেম সেটার: দ্বিমিক কম্পিউটিং
পাঁচ (5) অঙ্কের একটি সংখ্যার প্রথম এবং শেষ অঙ্কের যোগফল নির্ণয় করার প্রোগ্রাম লিখতে হবে।

ইনপুট

প্রোগ্রামটির প্রথম ইনপুট হবে একটি পূর্ণসংখ্যা T (1<=T<=10000), যা মোট কতটি পাঁচ অঙ্কের সংখ্যা ইনপুট নিতে হবে তা নির্দেশ করবে। পরবর্তিতে T সংখ্যক লাইনে একটি করে পূর্ণসংখ্যা N (10000<=N<=99999) ইনপুট নিতে হবে।

আউটপুট

প্রোগ্রামটির আউটপুটে N এর প্রথম এবং শেষ অঙ্কের যোগফল প্রিন্ট করতে হবে নিচের ছকে যেভাবে দেখানো আছে ঠিক সেই ফরম্যাটে। প্রতিটি আউটপুটের পরে একটি নিউলাইন প্রিন্ট করতে হবে। আউটপুটে "=" আগের এবং পরের স্পেসটি লক্ষণীয়।

স্যাম্পল ইনপুট আউটপুট
স্যাম্পল #1
ইনপুট
5
12345
56789
14310
10062
96587
আউটপুট
Sum = 6
Sum = 14
Sum = 1
Sum = 3
Sum = 16
'''
# Solution ***********************

t = int(input())
while(t != 0):
    n = int(input())
    last_digit = n % 10
    while (n != 0):
        r = n % 10
        #print("r = ",r)
        n = n // 10
        #print("n = ",n)
	
    print("Sum =",last_digit+r)  #ei laine  r = first digit
    t -= 1

#alternative solution
t = int(input())
while(t != 0):
    a = input()
    sum = int(a[len(a)-1])+int(a[0])
    print("Sum =",sum)  
t -= 1
